docs/app/controllers/events_controller.rb

  def create
    school = School.create(school_params) unless school_params[:name] == ""
    event = Event.new(event_params)
    event.school_id = school.id unless school_params[:name] == ""
    event.save
---
INSERT INTO `schools` (`name`, `created_at`, `updated_at`) VALUES ('ああ学校', '2019-07-02 07:08:02', '2019-07-02 07:08:02')
INSERT INTO `schools` (`name`, `created_at`, `updated_at`) VALUES ('ああ学校', '2019-07-02 06:40:47', '2019-07-02 06:40:47')
INSERT INTO `events` (`name`, `web_public`, `created_at`, `updated_at`, `school_id`, `public_stert_date`, `public_end_date`) VALUES ('運動会', '0', '2019-07-03 17:36:41', '2019-07-03 17:36:41', 2, '2019/07/03', '2019/08/02')