app/views/events/new.html.haml

SELECT `schools`.* FROM `schools`
---
          .select-wrap
            = f.collection_select(:school_id, School.all, :id, :name, { prompt: "" } , { class: "select-default", id: "school-select"} )
            .new-school-check